### Data Filtering

1

A country is big if:

it has an area of at least three million (i.e., 3000000 km2), or
it has a population of at least twenty-five million (i.e., 25000000).
Write a solution to find the name, population, and area of the big countries.

Return the result table in any order.


| name        | continent | area    | population | gdp          |

| Afghanistan | Asia      | 652230  | 25500100   | 20343000000  |

| Albania     | Europe    | 28748   | 2831741    | 12960000000  |

| Algeria     | Africa    | 2381741 | 37100000   | 188681000000 |

| Andorra     | Europe    | 468     | 78115      | 3712000000   |

| Angola      | Africa    | 1246700 | 20609294   | 100990000000 |

In [12]:
import pandas as pd
data = [['Afghanistan', 'Asia', 652230, 25500100, 20343000000], 
        ['Albania', 'Europe', 28748, 2831741, 12960000000], 
        ['Algeria', 'Africa', 2381741, 37100000, 188681000000], 
        ['Andorra', 'Europe', 468, 78115, 3712000000], 
        ['Angola', 'Africa', 1246700, 20609294, 100990000000]]

world = pd.DataFrame(data, 
                     columns=['name', 'continent', 'area', 'population', 'gdp']).astype(
    {'name':'object', 'continent':'object', 'area':'Int64', 'population':'Int64', 'gdp':'Int64'})

In [14]:
def biggest (word:pd.DataFrame):
    return word[(word['area']>=3000000) | (word['population']>=25000000)][
        ['name','population','area']]

biggest(world)

          name  population     area
0  Afghanistan    25500100   652230
2      Algeria    37100000  2381741

2

Write a solution to find the ids of products that are both low fat and recyclable.



product_id is the primary key (column with unique values) for this table.

low_fats is an ENUM (category) of type ('Y', 'N') where 'Y' means this product is low fat and 'N'

means it is not.

recyclable is an ENUM (category) of types ('Y', 'N') where 'Y' means this product is recyclable and

'N' means it is not.

In [3]:
import pandas  as pd

data=[[0,"Y","N"],
     [1,"Y","Y"],
     [2, "N" , "Y"],
     [3, "Y" , "Y"],
     [4, 'N' , 'N']]

df=pd.DataFrame(data=data , 
                columns=['product_id','low_fats','recyclable']).astype(
    {'product_id':'int64','low_fats':'str','recyclable':'str'})

df

   product_id low_fats recyclable
0           0        Y          N
1           1        Y          Y
2           2        N          Y
3           3        Y          Y
4           4        N          N

In [5]:
def rtrv(data:pd.DataFrame):
    return pd.DataFrame(df[(df['low_fats']=='Y')&(df['recyclable']=='Y')]['product_id'])

rtrv(df)

   product_id
1           1
3           3

3

Write a solution to find all customers who never order anything.

in customer_detail table Id is customer id and name is name of customer

in order_detail table id is the order id and cutomer_id is the id of cutomer who has ordered (refers to id in cstmr table)

In [11]:
import pandas as pd
data = [[1, 'Joe'], [2, 'Henry'], [3, 'Sam'], [4, 'Max']]

customer_detail=pd.DataFrame(data=data , columns=["Id" ,'Name']).astype({"Id":'int64','Name':"str"})

data1= [[1, 3], [2, 1]]

order_detail=pd.DataFrame(data=data1 , columns=['id' , 'customer_id'])

In [18]:
import pandas as pd

def rtrv(customer:pd.DataFrame , order:pd.DataFrame):
    dt=customer[~
                customer['Id'].isin(order['customer_id'])]['Name']
    return pd.DataFrame(dt).rename(columns={"Name":"customers"})

rtrv(customer_detail,order_detail)

  customers
1     Henry
3       Max

4

There is no primary key (column with unique values) for this table, the table may have duplicate rows.
Each row of this table indicates that some viewer viewed an article (written by some author) on some date. 
Note that equal author_id and viewer_id indicate the same person.
 

Write a solution to find all the authors that viewed at least one of their own articles.

Return the result table sorted by id in ascending order.

In [4]:
import pandas as pd

df=pd.DataFrame([[1, 3, 5, '2019-08-01'], 
                [1, 3, 6, '2019-08-02'],
                [2, 7, 7, '2019-08-01'], 
                [2, 7, 6, '2019-08-02'], 
                [4, 7, 1, '2019-07-22'],
                [3, 4, 4, '2019-07-21'], 
                [3, 4, 4, '2019-07-21']],columns=['article_id','author_id','viewer_id','date']).astype(
    {'article_id':'int64','author_id':'int64','viewer_id':'int64','date':'datetime64'})

df

   article_id  author_id  viewer_id       date
0           1          3          5 2019-08-01
1           1          3          6 2019-08-02
2           2          7          7 2019-08-01
3           2          7          6 2019-08-02
4           4          7          1 2019-07-22
5           3          4          4 2019-07-21
6           3          4          4 2019-07-21

In [15]:
def filter_(df : pd.DataFrame):
    matching_author=df[df['author_id']==df['viewer_id']]['author_id']
    unique_=matching_author.unique() 
    sort_=sorted(unique_)
    return pd.DataFrame({'id':sort_}).astype({'id':'int64'})

filter_(df)

   id
0   4
1   7

In [19]:
matching_author=df[df['author_id']==df['viewer_id']]['author_id']
 


pd.unique(matching_author.sort_values())

array([4, 7], dtype=int64)

5

Write a solution to find the IDs of the invalid tweets. The tweet is invalid if the number of characters used in the content of the tweet is strictly greater than 15.

Return the result table in any order.

In [19]:
import pandas as pd

data = [[1, 'Vote for Biden'], [2, 'Let us make America great again!']]
tweets = pd.DataFrame(data, columns=['tweet_id', 'content']).astype({'tweet_id':'Int64', 'content':'object'})

In [25]:
def invalid(df: pd.DataFrame):
    return pd.DataFrame(df[df.content.map(lambda x : len(x)>15)]['tweet_id'])

invalid(tweets)

   tweet_id
1         2

6  Write a solution to calculate the bonus of each employee. The bonus of an employee is 100% of their salary if the ID of the employee is an odd number and the employee's name does not start with the character 'M'. The bonus of an employee is 0 otherwise.

Return the result table ordered by employee_id.

In [27]:
data=[[2, 'Meir', 3000],
[3,'Michael', 3800],
[7,'Addilyn', 7400 ],[ 8 ,'Juan', 6100],
[ 9,'Kannon', 7700]]

df=pd.DataFrame(data,columns=['employee_id','name','salary']).astype({'employee_id':'int64','name':'str','salary':'int64'})

In [29]:
def bonuss(data:pd.DataFrame):
    data['bonus']=data.apply(lambda x:x['salary'] if x['employee_id']%2!=0 and x['name'][0]!='M' else 0,axis=1)
    return data[['employee_id','bonus']].sort_values(by=['employee_id'])

In [31]:
bonuss(df)

   employee_id  bonus
0            2      0
1            3      0
2            7   7400
3            8      0
4            9   7700

7 Write a solution to fix the names so that only the first character is uppercase and the rest are lowercase.

Return the result table ordered by user_id.

In [33]:
#creating dataframe
dt=[[ 1,'aLice'],
[2, 'bOB']]
df=pd.DataFrame(dt,columns=['id','name']).astype({'id':'int64','name':'str'})
df

   id   name
0   1  aLice
1   2    bOB

In [35]:
#solution
df['name']=df['name'].map(lambda x:x[0].upper()+x[1:].lower())
df.sort_values(by='id')

   id   name
0   1  Alice
1   2    Bob

In [37]:
#alternate
df['name']=df['name'].str.capitalize()
df

   id   name
0   1  Alice
1   2    Bob